app/views/users/index.html.erb

            </li>
          <li><small><%= pluralize(user.projects.count, "project") if user.projects %></small></li>
---
SELECT COUNT(*) FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 4]]