app/views/projects/_projects.html.erb

SELECT  1 AS one FROM "categories" INNER JOIN "project_categories" ON "categories"."id" = "project_categories"."category_id" WHERE "project_categories"."project_id" = $1 LIMIT 1  [["project_id", 16]]
---
        </div>
        <% if project.categories.any? %>