app/views/projects/show.html.erb

          <li><small>
            <%= pluralize(@project.user.projects.count, "project") if @project.user.projects %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 10]]
SELECT COUNT(*) FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 10]]

  <%= simple_format(@project.project_link) %>
  <% if @project.categories.any? %>
---
SELECT  1 AS one FROM "categories" INNER JOIN "project_categories" ON "categories"."id" = "project_categories"."category_id" WHERE "project_categories"."project_id" = $1 LIMIT 1  [["project_id", 3]]