app/controllers/categories_controller.rb

	def index
		@categories = Category.order(:name).all
---
SELECT "categories".* FROM "categories"  ORDER BY "categories"."name" ASC

	def show
		@category = Category.find(params[:id])
		@category_projects = @category.projects.paginate(page: params[:page], per_page: 5)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "projects".* FROM "projects" INNER JOIN "project_categories" ON "projects"."id" = "project_categories"."project_id" WHERE "project_categories"."category_id" = $1 LIMIT 5 OFFSET 0  [["category_id", 1]]
SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "projects" INNER JOIN "project_categories" ON "projects"."id" = "project_categories"."project_id" WHERE "project_categories"."category_id" = $1  [["category_id", 1]]