app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "projects"
---
  def index
    @projects = Project.paginate(page: params[:page], per_page: 5)

INSERT INTO "projects" ("title", "description", "project_link", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    #render plain: params[:project].inspect (just to view)
    @project = Project.new(project_params)
    @project.user = current_user
    if @project.save

UPDATE "projects" SET "description" = $1, "updated_at" = $2 WHERE "projects"."id" = $3
---
  def update

    if @project.update(project_params)