app/controllers/users_controller.rb

INSERT INTO "users" ("username", "full_name", "email", "password_digest", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at", "confirm_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "password_digest" = $1, "image_file_size" = $2, "image_updated_at" = $3, "image_file_name" = $4, "updated_at" = $5 WHERE "users"."id" = $6
---
  def update

    if @user.update(user_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."user_id" = $1 LIMIT 5 OFFSET 0  [["user_id", 10]]
SELECT COUNT(*) FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 10]]
---
  def show

    @user_projects = @user.projects.paginate(page: params[:page], per_page: 5)