app/views/layouts/_navigation.html.erb

SELECT "categories".* FROM "categories"  ORDER BY "categories"."name" ASC
---
          <ul class="dropdown-menu">
            <% Category.order(:name).all.each do |category| %>